IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_escss_regs.xml
<module id="ESCSS_REGS" HW_revision="" description="ESCSS Registers">
	<register id="ESCSS_IPREVNUM" width="32" page="1" offset="0x0" internal="0" description="IP Revision Number">
		<bitfield id="IP_REV_MINOR" description="Minor IP Revision Number" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="IP_REV_MAJOR" description="Major IP Revision Number" begin="7" end="4" width="4" rwaccess="R"/>
	</register>
	<register id="ESCSS_INTR_RIS" width="32" page="1" offset="0x2" internal="0" description="EtherCATSS Interrupt Raw Status">
		<bitfield id="SYNC0_RIS" description="SYNC0 feature RIS" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SYNC1_RIS" description="SYNC1 feature RIS" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="IRQ_RIS" description="EtherCATSS IRQ RIS" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DMA_DONE_RIS" description="DMA Done RIS" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="TIMEOUT_ERR_RIS" description="PDI bus Timeout Error RIS" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="MASTER_RESET_RIS" description="ECAT RESET RIS" begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="ESCSS_INTR_MASK" width="32" page="1" offset="0x4" internal="0" description="EtherCATSS Interrupt Mask">
		<bitfield id="SYNC0_MASK" description="SYNC0 feature Mask" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SYNC1_MASK" description="SYNC1 feature Mask" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IRQ_MASK" description="EtherCATSS IRQ Mask" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMA_DONE_MASK" description="DMA Done Mask" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TIMEOUT_ERR_MASK" description="PDI Access Timeout Error Mask" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MASTER_RESET_MASK" description="EtherCAT Master Reset Mask" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="ESCSS_INTR_MIS" width="32" page="1" offset="0x6" internal="0" description="EtherCATSS Masked Interrupt Status">
		<bitfield id="SYNC0_MIS" description="SYNC0 feature MIS" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SYNC1_MIS" description="SYNC1 feature MIS" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="IRQ_MIS" description="EtherCATSS IRQ MIS" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DMA_DONE_MIS" description="DMA Done MIS" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="TIMEOUT_ERR_MIS" description="PDI bus Timeout Error MIS" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="MASTER_RESET_MIS" description="EtherCAT Master Reset MIS" begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="ESCSS_INTR_CLR" width="32" page="1" offset="0x8" internal="0" description="EtherCATSS Interrupt Clear">
		<bitfield id="SYNC0_CLR" description="SYNC0 feature Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SYNC1_CLR" description="SYNC1 feature Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IRQ_CLR" description="EtherCATSS IRQ Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMA_DONE_CLR" description="DMA Done Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TIMEOUT_ERR_CLR" description="PDI Access Timeout Error Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MASTER_RESET_CLR" description="EtherCAT Master Reset Clear" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="ESCSS_INTR_SET" width="32" page="1" offset="0xa" internal="0" description="EtherCATSS Interrupt Set to emulate">
		<bitfield id="SYNC0_SET" description="SYNC0 Set Emulate" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SYNC1_SET" description="SYNC1 Set Emulate" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IRQ_SET" description="EtherCATSS IRQ Set Emulate" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMA_DONE_SET" description="DMA Done Set Emulate" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TIMEOUT_ERR_SET" description="PDI Access Timeout Error Set Emulate" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MASTER_RESET_SET" description="EtherCAT Master Reset Emulate" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ESCSS_LATCH_SEL" width="32" page="1" offset="0xc" internal="0" description="Select for Latch0/1 inputs and LATCHIN input">
		<bitfield id="LATCH0_SELECT" description="LATCH0 Inputs mux select" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="LATCH1_SELECT" description="LATCH1 Inputs mux select" begin="12" end="8" width="5" rwaccess="RW"/>
	</register>
	<register id="ESCSS_ACCESS_CTRL" width="32" page="1" offset="0xe" internal="0" description="PDI interface access control config. ">
		<bitfield id="WAIT_STATES" description="Minimum Wait States for VBUS Bridge" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="EN_TIMEOUT" description="PDI Timeout enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ENABLE_DEBUG_ACCESS" description="Debug access enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ENABLE_PARALLEL_PORT_ACCESS" description="Parallel port access enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TIMEOUT_COUNT" description="Max timecount programmed and count while enabled." begin="27" end="16" width="12" rwaccess="RW"/>
	</register>
	<register id="ESCSS_GPIN_DAT" width="32" page="1" offset="0x10" internal="0" description="GPIN data capture for debug and override">
		<bitfield id="GPIN_DAT" description="Registered GPI data driving EtherCAT GPI input" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESCSS_GPIN_PIPE" width="32" page="1" offset="0x12" internal="0" description="GPIN pipeline select">
		<bitfield id="GPI_PIPE" description="GPI IO inputs pipeline enable." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESCSS_GPIN_GRP_CAP_SEL" width="32" page="1" offset="0x14" internal="0" description="GPIN pipe group capture trigger">
		<bitfield id="GPI_GRP_CAP_SEL0" description="GPI7-0 capture trigger select" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="GPI_GRP_CAP_SEL1" description="GPI15-8 capture trigger select" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="GPI_GRP_CAP_SEL2" description="GPI23-16 capture trigger select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="GPI_GRP_CAP_SEL3" description="GPI31-24 capture trigger select" begin="14" end="12" width="3" rwaccess="RW"/>
	</register>
	<register id="ESCSS_GPOUT_DAT" width="32" page="1" offset="0x16" internal="0" description="GPOUT data capture for debug and override">
		<bitfield id="GPOUT_DAT" description="Registered GPO data from EtherCAT o/p" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="ESCSS_GPOUT_PIPE" width="32" page="1" offset="0x18" internal="0" description="GPOUT pipeline select">
		<bitfield id="GPO_PIPE" description="GPO output pipeline enable." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESCSS_GPOUT_GRP_CAP_SEL" width="32" page="1" offset="0x1a" internal="0" description="GPOUT pipe group capture trigger">
		<bitfield id="GPO_GRP_CAP_SEL0" description="GPO7-0 capture trigger select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPO_GRP_CAP_SEL1" description="GPO15-8 capture trigger select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPO_GRP_CAP_SEL2" description="GPO23-16 capture trigger select" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPO_GRP_CAP_SEL3" description="GPO31-24 capture trigger select" begin="13" end="12" width="2" rwaccess="RW"/>
	</register>
	<register id="ESCSS_MEM_TEST" width="32" page="1" offset="0x1c" internal="0" description="Memory Test Control">
		<bitfield id="INITIATE_MEM_INIT" description="Initialize memory init" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MEM_INIT_DONE" description="Memory Init done status" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="ESCSS_RESET_DEST_CONFIG" width="32" page="1" offset="0x1e" internal="0" description="ResetOut impact or destination config">
		<bitfield id="CPU_RESET_EN" description="CPU reset enable for ResetOut" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPU_NMI_EN" description="CPU NMI enable for ResetOut" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPU_INT_EN" description="CPU Interrupt enable for ResetOut" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DEVICE_RESET_EN" description="Enables RESET_OUT to impact the device reset" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ESCSS_SYNC0_CONFIG" width="32" page="1" offset="0x20" internal="0" description="SYNC0 Configuration for various triggers">
		<bitfield id="C28x_PIE_EN" description="Connects the SYNC0 to C28x PIE Interrupt" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLA_INT_EN" description="Connects the SYNC0 to CLA Interrupt" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="C28x_DMA_EN" description="Connects the SYNC0 to C28x DMA Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CM4_NVIC_EN" description="Connects the SYNC0 to CM4 NVIC Interrupt" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="uDMA_TRIG_EN" description="Connects the SYNC0 to uDMA Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ESCSS_SYNC1_CONFIG" width="32" page="1" offset="0x22" internal="0" description="SYNC1 Configuration for various triggers">
		<bitfield id="C28x_PIE_EN" description="Connects the SYNC1 to C28x PIE Interrupt" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLA_INT_EN" description="Connects the SYNC1 to CLA Interrupt" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="C28x_DMA_EN" description="Connects the SYNC1 to C28x DMA Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CM4_NVIC_EN" description="Connects the SYNC1 to CM4 NVIC Interrupt" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="uDMA_TRIG_EN" description="Connects the SYNC1 to uDMA Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
</module>
